src/cf/src/InformationRegisters/ТелеграмСобеседники/ТелеграмСобеседники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмСобеседники</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СчетчикПринятыхСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>last_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>username</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПозволятьОбщение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЧата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмНастройкиПользователей/ТелеграмНастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмНастройкиПользователей</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПраваДоступа</name>
    <type>
      <types>EnumRef.ТипыПользователейЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЧата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмСобеседники/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 // Заполнение существующих уже данных из регистра "ТелеграмНастройкиПользователей".
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	*
	 |ИЗ
	 |	РегистрСведений.ТелеграмНастройкиПользователей КАК ТелеграмНастройкиПользователей
	 |ГДЕ
	 |	ТелеграмНастройкиПользователей.Бот = &Бот
	 |	И ТелеграмНастройкиПользователей.ИдентификаторЧата = &ИдентификаторЧата";
	 
	 Запрос.УстановитьПараметр("Бот", Запись.Бот);
	 Запрос.УстановитьПараметр("ИдентификаторЧата", Запись.ИдентификаторЧата);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	  ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	 
	 КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Фиксация изменений по данным для регистра "ТелеграмНастройкиПользователей".
	МенеджерЗаписи = РегистрыСведений.ТелеграмНастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Запись.Бот;
	МенеджерЗаписи.ИдентификаторЧата = Запись.ИдентификаторЧата;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		// новый
		МенеджерЗаписи.Бот = Запись.Бот;
		МенеджерЗаписи.ИдентификаторЧата = Запись.ИдентификаторЧата;
	КонецЕсли;
	// обновляем данные
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтаФорма);
	
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры
